app/controllers/answers_controller.rb

SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT 1  [["id", nil]]
INSERT INTO "answers" ("body", "question_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["body", "aasdfasdfasdfasdfasdfasdfsdafdsafsadfasdfsadfasdfasd"], ["question_id", 3], ["created_at", "2015-06-24 19:03:02.238020"], ["updated_at", "2015-06-24 19:03:02.238020"]]
---
  def create
    @errors = Array.new
    @question = Question.find(params[:question_id])
    @answer = Answer.new(answer_params)
    @answer.question = @question

    if @answer.save