app/controllers/questions_controller.rb

  def index
    @questions = Question.order(created_at: :DESC)
---
SELECT "questions".* FROM "questions"  ORDER BY "questions"."created_at" DESC

  def show
    @question = Question.find(params[:id])
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1  ORDER BY "questions"."id" ASC LIMIT 1  [["id", 2]]

  def create
    @errors = Array.new
    @question = Question.create(question_params)
---
INSERT INTO "questions" ("title", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"

  def update
    @errors = Array.new
    @question = Question.find(params[:id])
    @question.update(question_params)
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT 1  [["id", 3]]
UPDATE "questions" SET "title" = $1, "updated_at" = $2 WHERE "questions"."id" = $3  [["title", "fdopsahiuafddfsafddfsagfashiosfdpuadfsphoifadsdfhpshiopdspdhsafdshfadshoadfspoghopidsoigadfijofgadsfjiopadsfijopads"], ["updated_at", "2015-06-24 21:02:18.848791"], ["id", 3]]

  def destroy
    @question = Question.find(params[:id]).destroy
---
DELETE FROM "questions" WHERE "questions"."id" = $1  [["id", 2]]
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT 1  [["id", 2]]