app/controllers/questions_controller.rb

  def show
    @question = Question.where(id: params[:id]).first
    @answers = Answer.where(question_id: params[:id])
---
SELECT  "answers".* FROM "answers" WHERE "answers"."question_id" = $1  ORDER BY "answers"."id" ASC LIMIT 1  [["question_id", 2]]